export default {
  api: {
    get: kindo.api.medControlFee + '11',
    getDq: kindo.api.medControlFee + '22'
  },
  mock: {
    get: {
      code: 200,
      message: '成功',
      data: {
        'rows|2': [
          { a: 'A31002', b: '中枢神经系统感染，有一般合并症并发症', c: '2', d: '1.84', e: '0.92', f: '0.21', g: '中高风险组', h: '0', i: '0' },
          { a: 'A31001', b: '中枢神经系统感染，无合并症并发症', c: '2', d: '1.51', e: '0.78', f: '0.15', g: '中高风险组', h: '0', i: '0' },
          { a: 'A31004', b: '中毒、营养代谢障碍、其他系统疾病的神经系统并发症，无合并症并发症', c: '6', d: '4.68', e: '0.78', f: '0.8', g: '中低风险组', h: '0', i: '0' },
          { a: 'A31004', b: '周围神经病，无合并症并发症', c: '5', d: '4.56', e: '0.76', f: '1.19', g: '中低风险组', h: '0', i: '0' },
          { a: 'A30104', b: '神经肿瘤的化学治疗及支持治疗，无合并症并发症', c: '20', d: '4.2', e: '2.1', f: '0.22', g: '中低风险组', h: '0', i: '0' },
          { a: 'A30804', b: '神经系统遗传、发育疾病及神经系统变性病，无合并症并发症', c: '10', d: '8.3', e: '0.83', f: '0.4', g: '中低风险组', h: '0', i: '0' },
          { a: 'A31426', b: '神经肌肉接头及肌肉病', c: '9', d: '6.39', e: '0.71', f: '0.74', g: '中低风险组', h: '0', i: '0' },
          { a: 'A31204', b: '昏迷，无合并症并发症', c: '3', d: '3.21', e: '1.07', f: '0.9', g: '中高风险组', h: '0', i: '0' },
          { a: 'A39904', b: '其他神经系统疾病，无合并症并发症', c: '118', d: '80.24', e: '0.68', f: '0.59', g: '中高风险组', h: '0', i: '0' },
          { a: 'A31030', b: '周围神经病，无合并症并发症', c: '5', d: '4.56', e: '0.76', f: '1.19', g: '中低风险组', h: '0', i: '0' }
        ],
        total: 360
      }
    },
    getDq: {
      code: 200,
      message: '成功',
      data: {
        'rows|2': [
          { a: 'A31002', b: '中枢神经系统感染，有一般合并症并发症', c: '2', d: '1.73', e: '0.81', f: '0.21', g: '中高风险组', h: '0', i: '0' },
          { a: 'A31001', b: '中枢神经系统感染，无合并症并发症', c: '2', d: '1.76', e: '0.88', f: '0.15', g: '中高风险组', h: '0', i: '0' },
          { a: 'A31004', b: '中毒、营养代谢障碍、其他系统疾病的神经系统并发症，无合并症并发症', c: '6', d: '4.6', e: '0.71', f: '0.8', g: '中低风险组', h: '0', i: '0' },
          { a: 'A31004', b: '周围神经病，无合并症并发症', c: '5', d: '4.62', e: '0.79', f: '1.19', g: '中低风险组', h: '0', i: '0' },
          { a: 'A30104', b: '神经肿瘤的化学治疗及支持治疗，无合并症并发症', c: '20', d: '38.71', e: '1.58', f: '0.22', g: '中低风险组', h: '0', i: '0' },
          { a: 'A30804', b: '神经系统遗传、发育疾病及神经系统变性病，无合并症并发症', c: '10', d: '8.21', e: '0.79', f: '0.4', g: '中低风险组', h: '0', i: '0' },
          { a: 'A31426', b: '神经肌肉接头及肌肉病', c: '9', d: '6.56', e: '0.84', f: '0.74', g: '中低风险组', h: '0', i: '0' },
          { a: 'A31204', b: '昏迷，无合并症并发症', c: '3', d: '3.71', e: '1.39', f: '0.9', g: '中高风险组', h: '0', i: '0' },
          { a: 'A39904', b: '其他神经系统疾病，无合并症并发症', c: '118', d: '84.21', e: '0.97', f: '0.59', g: '中高风险组', h: '0', i: '0' },
          { a: 'A31030', b: '周围神经病，无合并症并发症', c: '5', d: '4.16', e: '0.67', f: '1.19', g: '中低风险组', h: '0', i: '0' }
        ],
        total: 400
      }
    }
  }
}
